{
  "meta": {
    "description": "Álex Bayo Saiz is a digital product designer with extensive experience in programming and interactive design principles. He is open to collaborating on app and website projects for startups, brands, and entrepreneurs, delivering innovative and user-centered solutions.",
    "keywords": "product design, interface design, interactive design, user experience, user interface, web design, responsive design, team leader, usability, user research",
    "og_title": "Álex Bayo Saiz - Digital Product Designer",
    "about": {
      "title": "Álex Bayo Saiz | About me"
    },
    "home": {
      "title": "Álex Bayo Saiz | Home"
    },
    "kikoto": {
      "description": "Álex Bayo Saiz - Kikoto, a ferry ticket purchasing portal and cross-platform software, crafted with care and dedication."
    },
    "studeng": {
      "description": "Álex Bayo Saiz - Studeng+, an app that makes learning exciting and fun."
    },
    "aumentur": {
      "description": "Álex Bayo Saiz - Aumentur, an app to discover the world through augmented reality."
    },
    "customized": {
      "description": "Álex Bayo Saiz - Customized, tailored diabetes training for Internal Medicine specialists."
    },
    "eva": {
      "description": "Álex Bayo Saiz - EVA Certification, a platform for mobile app evaluation and certification."
    }
  },
  "common": {
    "loading": "Loading...",
    "loading_prototype": "Loading prototype...",
    "video_no_support": "Your browser does not support the video element.",
    "video_poster": "Video thumbnail",
    "title": "My portfolio",
    "product_designer": "Digital Product Designer",
    "project_overview": "Featured projects",
    "scroll": "Scroll to see more",
    "back": "Home",
    "go_back": "Go back",
    "about_project": "About the project",
    "open_case_study": "Discover the project",
    "role": "Role",
    "client": "Client",
    "date": "Date",
    "typography": "Typography",
    "colors": "Colors",
    "expand": "Expand",
    "view_prototype": "View prototype<span class=\"icon\">👆</span>",
    "let_start_title": "Let's work together!",
    "let_start_subtitle": "Let's start creating excellent experiences and products!",
    "let_start_text": "Let's transform ideas into products that not only look amazing but also function perfectly. Ready to create something innovative? I would be delighted to hear from you. Write to me at <a href=\"mailto:alexbayosaiz@gmail.com\" class=\"text-light\">alexbayosaiz@gmail.com</a> and let's start an incredible creative adventure.",
    "old_projects": "Old projects",
    "404_title": "Error 404",
    "404_subtitle": "The page you are looking for was moved, removed or might never existed.",
    "404_button": "Go to homepage"
  },
  "about": {
    "hi": "Hi, I'm Álex",
    "intro": "I design digital products and brands for clients of all kinds. I also work freelance, applying all my creativity.",
    "lead1": "I’m a digital product designer.",
    "lead2": "With extensive experience in frontend programming.",
    "lead3": "Based in Spain, I’m here to create products.",
    "at_work": "At work",
    "at_work_description": "<p>My process starts with a personal conversation to learn about the client’s story and motivations. This helps me create a clear mental map of the challenges their project aims to solve. From there, I ask many questions and present simple sketches or wireframes to visualize the initial idea and make sure we’re on the same page.</p><p>With this foundation, I develop the main design system, where the priority is establishing solid branding and a logo that resonates with both the client and myself, marking the start of a robust identity. Then, I select the right tech stack and move on to high-fidelity prototyping, usually in Figma, to create a testable and valid product mockup.</p><p>From there, the journey continues towards creating the final product, ensuring each stage aligns with the client’s vision and expectations. Are you in?</p>",
    "at_work_figcaption": "Poster <a href='https://www.escuelaartegranada.com/Noticia-773-Charla-Web-Union-Granada' target='_blank'><i>Frontend and best practices</i></a> at <a href='http://webuniongranada.com/' target='_blankk'>Web Union Granada</a>. 2018.",
    "at_work_figcaption1": "Talk <a href='https://www.escuelaartegranada.com/Noticia-773-Charla-Web-Union-Granada' target='_blank'><i>Frontend and best practices</i></a> at <a href='http://webuniongranada.com/' target='_blank'>Web Union Granada</a>. 2018.",
    "at_work_figcaption2": "Starting at Everyware Technologies. 2018. <a href='https://www.escuelaartegranada.com/Noticia-785-Alejandro-Bayo---Everyware-Technologies' target='_blank'>See news</a>.",
    "product_design": "Product Design",
    "product_design_description": "<p>My design approach centers on understanding client and end-user needs, enabling me to create visually appealing and functional products. From branding and visual identity to developing design systems in modern tools like Figma, ProtoPie, or Adobe XD, I specialize in building cohesive, scalable experiences.</p><p>My background in graphic design and UI/UX, paired with a solid understanding of brand image, ensures that each product I create has significant impact.</p>",
    "frontend": "Frontend Programming",
    "frontend_description": "<p>Over the years, I’ve acquired valuable and versatile experience in frontend technologies, including HTML5, CSS3 (and preprocessors like Pug and SCSS), JavaScript, TypeScript, and frameworks like Angular, React, Vue, and Ionic, among others.</p> <p>The ability to code everything I propose and build in the initial phases of product design lets me translate design systems into fluid interfaces, optimizing usability and accessibility.</p> <p>My capacity to prototype directly in the frontend has been crucial in large-scale projects, where fast iteration is key to success.</p>",
    "team_leading": "Team Management and Leadership",
    "team_leading_description": "<p>I’ve led teams in complex projects, ensuring effective coordination between designers, developers, and stakeholders. My project management and leadership experience allows me to stay focused on objectives while motivating the team to overcome challenges and maintain high quality standards. My ability to communicate with clients and the development team facilitates quick problem-solving and ensures each project stage aligns with expectations.</p><p>This multidisciplinary profile lets me offer a comprehensive approach, combining creative vision with technical and strategic execution to design and develop exceptional digital products.</p>",
    "at_life": "In my personal life",
    "at_life_description": "<span class='fs-1'>🏔️</span><p>I’ve been into sports since I was 7; I competed in soccer, but individual sports have always attracted me more, especially those that connect me with nature. Trail running is my favorite escape, giving me the space I need to breathe and think. I also enjoy biking—both mountain and road biking—and I stay in shape to take care of my health and energy.</p><span class='fs-1'>🍔</span><p>I love eating (burgers are my weakness), and when I have time, I enjoy cooking my favorite meals, with my mom’s stew always at the top of the list.</p><span class='fs-1'>🍻</span><p>Socially, I’m always the organizer, the one who rallies friends and makes sure everything goes well. If the party’s good, I’m the life of it. I love talking and getting everyone involved; it’s one of my trademarks. I also enjoy beer and wine at a bar with rock music while playing foosball.</p><span class='fs-1'>🎤</span><p>I’ve been doing beatbox for 16 years, and it’s a fundamental part of my life. Rhythm and music are always with me, whether I’m in the office, on the street, or biking. I also enjoy drawing, a passion since childhood that has always allowed me to concentrate and improve.</p>"
  },
  "projects": {
    "kikoto": {
      "name": "Kikoto",
      "main_lead": "A portal for buying ferry tickets, crafted with care and dedication.",
      "introduction": "Building a ferry ticket purchasing portal from scratch.",
      "description": "A few years ago, we embarked on a journey. One of our clients wanted to develop software for ferry ticket sales. At that time, there were already some competitors offering this service, so it was time to aim for excellence and differentiation. <br><br> From that moment, I got to work and began a dedicated design of the entire product. It has been a long journey, but we finally reached our destination. <br><br>Kikoto, the portal dedicated to the online brokerage of ferry ticket bookings from various national ferry operators for domestic and international travel.",
      "action_text": "Go to the website <i class=\"baicon-arrow-right\"></i>",
      "role_1": "Brand Design",
      "role_2": "UI/UX",
      "role_3": "Product Design",
      "role_4": "Frontend",
      "client_1": "Kikoto",
      "date": "2020 - Present",
      "figcaption_1": "Night view of the Kikoto project. Designed by </span><a href=\"https://www.freepik.es/\" target=\"_blank\">Freepik</a>.",
      "figcaption_2": "Decorative illustration of a sunset by a coast with a lighthouse. Designed by </span><a href=\"https://www.freepik.es/\" target=\"_blank\">Freepik</a>.",
      "visual_identity_title": "Visual identity",
      "visual_identity_subtitle": "Creating the Kikoto brand",
      "visual_identity_description": "I developed a strong and distinctive brand from scratch, paying special attention to every detail. I selected a carefully chosen color palette and a rounded typography to reflect the essence of the ocean and the sea. The result is a recognizable visual identity, with an impactful keyword, a defined voice, unique illustrations, and solid values that reinforce the brand.",
      "logo_title": "Logo",
      "logo_subtitle": "Finding the right direction",
      "logo_subtitle2": "Where are we headed?",
      "logo_description": "Initially, I was tasked with designing the logo for a ferry company called Kikoto. My first ideas explored the use of a ship's wheel combined with a rounded font to reflect the nautical spirit. However, the client had one clear instruction: 'We don’t want the typical ship's wheel.' After this feedback and several iterations, I came up with the final version of the logo, integrating a modern compass icon that also resembled a computer pointer. Our software now had direction!",
      "first_versions": "First versions",
      "logo_figcaption": "Kikoto logo.",
      "ui_title": "UI/UX design",
      "ui_subtitle": "Responsive prototyping based on the frontend technology",
      "ui_description": "The biggest challenge was adapting the design, user experience, and usability to the frontend stack we were using. We worked with a cross-platform Progressive Web App (PWA) environment, using Ionic and Angular as the frontend framework. Thanks to my experience coding with Ionic components and customizing the layout in CSS, I was aware of the limits and possibilities of prototyping. This is how the iteration of the UI/UX design system began—a phase I greatly enjoyed, though it was also the most challenging.",
      "ui_prototype_web": "Interactive web prototype 👇 🖥️",
      "ui_prototype_mobile": "Interactive mobile prototype 👇 📱",
      "ui_figcaption_desktop": "First version of the web prototype in Adobe XD.",
      "ui_figcaption_mobile": "First version of the mobile prototype in Adobe XD.",
      "hurry_title": "I'm in a hurry",
      "hurry_subtitle": "Standing out from the competition",
      "hurry_description": "We needed to develop a standout feature that would allow users to purchase their ferry ticket as quickly as possible, easily and intuitively. I drew inspiration from Airbnb's design for their accommodation search flow, which presents a modal from the bottom of the screen and allows interaction in an organized, step-by-step linear process. The flow would be initiated from the central button in the bottom navigation bar, taking full prominence of the app and making it clear that this feature was the product's focus. The content would include the data stored in the user's account settings, making everything faster and easier. Pretty cool, right?",
      "hurry_figcaption": "Call to action for the <span class=\"fst-italic\">I'm in a hurry</span> feature on Kikoto's website.",
      "hurry_video_title": "<span class=\"fst-italic\">I'm in a hurry</span> feature in the iOS app",
      "hurry_video_figcaption": "Video recorded directly on my phone using the app.",
      "illustrations_title": "Custom illustration system",
      "illustrations_subtitle": "Creating an attractive, persuasive, and consistent visual language",
      "illustrations_description": "The illustrations used in the app are based on Freepik resources, carefully adapted to fit the app's color palette. This illustration system runs throughout the software, creating a coherent visual identity and enhancing the user experience. The illustrations not only beautify the interface but also capture potential users' attention in app stores, strengthening engagement and the product's visual presence.",
      "illustrations_section": "Project illustrations",
      "stores_title": "We’re taking it to the stores!",
      "stores_subtitle": "Visual adaptation for iOS and Google Play with a multilingual approach",
      "stores_description": "To launch the app in the stores, I designed a series of screenshots that tell an engaging visual story, aligned with the app’s overall design system. Each screenshot was carefully crafted to capture users' attention and reflect the app’s identity. The process included adapting for iPhone, iPad, and Android devices, meeting the requirements of both the Apple and Google Play stores. Additionally, each set of designs was translated and adjusted into three languages: Spanish, English, and French, which added a logistical challenge but was essential for reaching a global audience.",
      "stores_section_ios": "Screenshots for Apple Store (iPhone and iPad)",
      "stores_section_android": "Screenshots for Google Play",
      "learn_title": "What did I learn?",
      "learn_subtitle": "Creating an identity from scratch is both a challenge and an opportunity",
      "learn_description": "This project allowed me to solidify my experience in creating a complete corporate image, from concept to application across different platforms, using my own graphic resources.",
      "learn_subtitle_2": "Client feedback is key, but the end user rules",
      "learn_description_2": "I learned to manage client feedback, adjusting changes and solutions while always keeping the end user’s needs in mind.",
      "learn_subtitle_3": "Drawing inspiration from the competition is smart",
      "learn_description_3": "Observing major brands like Airbnb, Vueling, or SkyScanner showed me that taking inspiration from established companies is not only valid but beneficial for improving design solutions."
    },
    "studeng": {
      "name": "Studeng+",
      "main_lead": "An app that makes learning exciting and fun.",
      "introduction": "Exciting learning",
      "description": "<p>Studeng+ marked an exciting journey towards transformative learning. From the beginning, we set out to create an app that not only teaches but also inspires and motivates students of all ages. In this educational environment, carefully designed challenges are combined with 3D models and gamification elements to make learning a fun and engaging experience.</p><p>The most rewarding part of this project was the total creative freedom to design from scratch, which allowed me to explore new ideas and approaches. Additionally, I'm proud to help students and unaccompanied minors, contributing to their personal and academic development.</p><p>With Studeng+, every challenge becomes an opportunity to learn and grow, taking learning to the next level.</p>",
      "action_text": "Go to the website <i class=\"baicon-arrow-right\"></i>",
      "role_1": "Product Design",
      "role_2": "Branding",
      "role_3": "UI/UX",
      "role_4": "Frontend",
      "client_1": "<a href=\"https://grupoitaca.ugr.es\" target=\"_blank\" class=\"text-dark\">Ítaca Research Group</a> at the University of Granada.",
      "date": "March 2023 - Present",
      "figcaption_1": "Studeng+ project resource.",
      "visual_identity_title": "Visual identity",
      "visual_identity_subtitle": "Creating the Studeng+ brand",
      "visual_identity_description": "<p>From the start of the project, my goal was to create a learning experience that transcends classrooms. I chose a vibrant green as the primary color, symbolizing growth and learning, complemented by purple to evoke calmness and reflection in the face of challenges.</p><p>The pastel color palette I used is inspired by Material Design 3 and Material You, allowing for a visually pleasant and modern interaction. Rounded shapes and 3D elements support customizable avatars, creating an emotional connection with users.</p><p>Additionally, I selected Nunito, a font reminiscent of comic letters, designed to be friendly and accessible, ideal for children and young people. The result is a cohesive and attractive visual identity that not only reinforces the brand but also fosters a positive and motivating learning environment.</p>",
      "logo_title": "Logo",
      "logo_subtitle": "A simple idea that works",
      "logo_description": "When there is creative freedom to develop an idea, the results are often positive. For the Studeng logo, I drew inspiration from an educational and learning environment, opting for a font that conveyed that character. I chose Baloo, a font with a rounded and robust style, almost calligraphic, but perfectly suited to the software world. Its design evokes students who drew those perfectly even, round letters, full of personality, doesn’t it? Additionally, I incorporated a detail on the letter 'g' that mimics a graduation cap, further reinforcing the educational connection.",
      "logo_figcaption": "Studeng logo. v1",
      "logo2_title": "Rebranding",
      "logo2_subtitle": "Small tweaks to the original design",
      "logo2_description": "In the software world, sometimes clients need to make changes or adaptations to their brand name, whether for legal reasons or other purposes. These adjustments can interfere with the original idea and design. In this case, it was necessary to add the concept of <i>Plus</i> to the software’s name, in a way that was visible and naturally integrated into the product’s identity. Since simplicity was the strong point of the initial design, I decided to continue with that same minimalist approach for this adaptation.",
      "logo2_figcaption": "Studeng+ logo. v2",
      "ui_title": "UI/UX design on the frontend",
      "ui_subtitle": "Prototyping directly on the frontend",
      "ui_description": "<p>With tight deadlines and a limited budget that didn’t allow for a first prototyping phase in Figma, the design process had to be more agile and adaptive. It was necessary to build the prototype directly while coding the frontend using Ionic and Angular. This approach posed a real challenge as it made it harder to apply a coherent design system that worked optimally across all platforms. The final product had to be a PWA with a launch on the App Store, requiring special care for visual and functional consistency.</p><p>For the design, I drew inspiration from the new trends introduced by Material Design 3, which had just been released. Since Materialize, based on Material Design 2, had been chosen at the start of the project, transitioning to the next evolution of the system made perfect sense to me. I found a perfect harmony with the new pastel palettes and colors that fit the product’s identity I wanted to achieve: tones that evoke the school environment, like the pastel green of classroom walls, the dark green of blackboards, and the natural tones of desks and chairs... Everything!</p><p>This was when I began bringing the design to life, aiming to capture the essence of that atmosphere through a modern and friendly interface.</p>",
      "ui_prototype_web": "UI/UX web light and dark modes. Homepage 👆 🖥️",
      "ui_prototype_mobile": "UI/UX of the iOS mobile app. Recorded on my phone. 👆 📱",
      "illustrations_title": "3D aesthetic illustration system",
      "illustrations_subtitle": "Creating a modern, consistent, and eye-catching visual language",
      "illustrations_description": "The illustrations used in the app, based on free resources and libraries, have been carefully adapted to fit the simple design system. What truly stands out is the incorporation of 3D elements that extend the visual language and create perfect cohesion with the inclusion of the customizable avatar, developed in three dimensions by an external company. This integration not only brings coherence to the product but also gives it a visual appeal that is irresistible to children. The 3D illustrations not only beautify the interface but, along with the avatar, create an immersive experience that encourages users to explore and play, reinforcing the product’s identity.",
      "video_title": "The perfect final touch!",
      "video_subtitle": "A video that brings Studeng+ to life",
      "video_description": "To top off the project, I immersed myself in creating a promotional video entirely from scratch. Leveraging my experience with After Effects, I searched for free templates that could serve as a foundation to adapt the product’s entire design system and visual language. The result was a magnificent video that not only explains how Studeng+ works but also reflects the essence of the product in a dynamic and engaging way. Every detail of the design came to life on screen, clearly and visually communicating the software’s value proposition. It was, without a doubt, the perfect finishing touch—a proud achievement.",
      "video_figcaption": "Studeng+ promotional video. Created with After Effects.",
      "learn_title": "What did I learn?",
      "learn_subtitle": "A design system that blends the new and the classic",
      "learn_description": "The project’s development allowed me to design a visual system integrating elements completely new to me, like using 3D to create coherent and dynamic resources. Additionally, the Material Design 3 guidelines offered a modern approach, helping me build a solid visual harmony.",
      "learn_subtitle_2": "Improvements in coding and real-time prototyping",
      "learn_description_2": "With no time for Figma prototyping, the design process had to be done directly on the frontend using Ionic and Angular. This not only forced me to refine my coding skills but also develop creative solutions along the way to ensure the design system worked perfectly across all platforms.",
      "learn_subtitle_3": "Expanding scope with additional skills",
      "learn_description_3": "The project also allowed me to leverage my knowledge in other technologies to bring comprehensive strength to the product. Creating the promotional video in After Effects not only reinforced the project’s visual identity but also added value, showcasing the software with a professional and appealing touch."
    },
    "aumentur": {
      "name": "Aumentur",
      "main_lead": "An application to discover the world through augmented reality.",
      "introduction": "Immersive exploration and learning",
      "description": "<p>Aumentur has been a unique experience in the realm of immersive learning and cultural exploration. From the beginning, the goal was to develop an application that allowed users to experience art, history, and culture in an innovative way, using augmented reality to create a deep connection with their surroundings.</p><p>The freedom to experiment with new technologies was one of the most rewarding parts of the project, enabling me to implement creative solutions and explore innovative approaches to user experience. The application thus becomes a tool to transform how users discover and learn about the world around them.</p>",
      "action_text": "Visit the website <i class=\"baicon-arrow-right\"></i>",
      "role_1": "Product Design",
      "role_2": "Branding",
      "role_3": "UI/UX",
      "client_1": "<a href=\"https://www.aumentur.app\" target=\"_blank\" class=\"text-dark\">Aumentur</a>",
      "date": "2020 - 2024",
      "figcaption_1": "Resource from Aumentur project.",
      "visual_identity_title": "Visual identity",
      "visual_identity_subtitle": "The right color and typography",
      "visual_identity_description": "<p>From the start of the project, my objective was to create a visual identity that not only conveyed exploration and discovery but also captured users' attention from the very first moment. To achieve this, I chose orange as the base of the palette, as it is associated with stimulating mental activity and fostering social interaction. These vibrant and energetic tones are perfect for a tourism application, providing an ideal starting point to capture users' curiosity and interest.</p><p>Additionally, I opted to use a single typography, Ubuntu, which proved to be versatile for both the logo and the interface design. Its modern and legible style fit perfectly in the digital environment, offering a comprehensive solution that facilitated the creation of a coherent and attractive visual identity for Aumentur. With these simple yet carefully selected elements, it was possible to build a visual experience that reflects the dynamic essence of the application.</p>",
      "logo_title": "Logo",
      "logo_subtitle": "A visual representation of exploration",
      "logo_description": "<p>The design of the Aumentur logo is inspired by the idea of a compass, symbolizing connection and the search for new experiences. The icon is the central element of the logo: a stylized compass within a speech bubble, evoking communication, community, and interaction. The lines mimicking the connection bars in the compass suggest the idea of being connected to knowledge, as if it were a WiFi signal guiding us toward exploration.</p><p>The choice of geometric shapes and contrasting colors ensures that the logo is easily recognizable, highlighting the essence of discovery. The typography accompanying the icon reinforces the visual identity without overshadowing the central symbol, achieving a balance between simplicity and meaning.</p>",
      "logo_figcaption": "Logo of Aumentur.",
      "ui_title": "UI/UX design",
      "ui_subtitle": "Prototyping with an immersive user experience in mind",
      "ui_description": "<p>I had complete freedom to shape the client's specifications, which allowed me to approach this project with a comprehensive and creative vision. The application needed to provide a complete and versatile user experience, communicating intelligently with monuments. To achieve this, features were incorporated that allowed interaction through QR code scanning, proximity devices, map tracking, audio descriptions, and 3D visualizations of points of interest.</p><p>The challenge was not limited to implementing these features; it also involved organizing a large amount of information in an accessible and engaging manner. The application included details about visit progress, milestones, duration, prices, and the ability to access everything in multiple languages. It was an exciting challenge that allowed me to create a complete experience, ensuring that every function and workflow met the expectations of the end user and maximized their exploration experience.</p>",
      "ui_prototype_mobile": "Mobile prototype (interactive). 👇 📱",
      "ui_figcaption_mobile": "First version of the mobile prototype in Adobe XD.",
      "ui_prototype_mobile2": "UI/UX of the iOS mobile app. Recorded on my device. 👇 📱",
      "ui_figcaption_mobile2": "Video recorded directly on my phone using the app.",
      "learn_title": "What did I learn?",
      "learn_subtitle": "Merging the real world with the digital experience",
      "learn_description": "The design of Aumentur involved combining and synthesizing multiple functionalities and client requirements, integrating elements of the real world with the experience of a user on their phone. Each feature, from QR code scanning and proximity devices to map tracking and audio descriptions, intertwined to create an immersive and coherent experience that facilitated exploration and learning.",
      "learn_subtitle_2": "The value of prototyping in Adobe XD",
      "learn_description_2": "Working with a prototyping phase in Adobe XD turned out to be one of the best decisions. It allowed me to obtain valuable feedback from both the client and the development team, ensuring complete alignment from the start. The prototype not only served as a clear guide for subsequent coding but also saved time and resources, achieving a high-quality final product with a more agile and efficient implementation."
    },
    "customized": {
      "name": "Customized",
      "main_lead": "Tailored diabetes training for Internal Medicine specialists.",
      "introduction": "Custom training software for Medicine",
      "description": "<p>For the Customized project, the main focus was the frontend design, adapting the client's concept and ensuring that the interface looked and worked perfectly on both mobile devices and large screens. I worked on adapting the branding and visual identity, creating an icon that captured the essence of the proposed logo, giving it a unique touch.</p><p>The real challenge and learning experience came from working with Ionic, a technology that allowed me to take the user experience to another level. I managed to create a flawless interface in terms of design, functionality, and usability, overcoming the difficulties inherent in developing the entire frontend with this tool. It was a complete adaptation of the client's vision materialized in the final product.</p>",
      "action_text": "Visit the website <i class=\"baicon-arrow-right\"></i>",
      "role_1": "Product Design",
      "role_2": "Branding",
      "role_3": "UI/UX Frontend",
      "client_1": "<a href=\"https://www.fesemi.org\" target=\"_blank\" class=\"text-dark\">Spanish Society of Internal Medicine (SEMI)</a>",
      "date": "2021 - 2023",
      "figcaption_1": "Resource from the Customized project.",
      "visual_identity_title": "Visual identity",
      "visual_identity_subtitle": "Building on a solid foundation",
      "visual_identity_description": "<p>The client provided a mobile prototype in Adobe XD that served as a starting point for the visual development of the project. Some of the initial proposals had great potential, and to ensure perfect alignment with the client, I decided to keep the proposed logo, making only a few technical adjustments to optimize its use at the vector level. Additionally, I designed a small icon in the same aesthetic style to complement the identity. The original color palette and fonts were retained as they proved to be an excellent base for building a coherent and appealing visual identity.</p>",
      "logo_title": "Logo",
      "logo_subtitle": "Refining the logo and integrating a new icon",
      "logo_description": "The logo provided by the client served as a starting point, with a proposal that already captured the essence of the brand. I made some technical improvements to the vector design to optimize it and give it a more polished look. I also created a complementary icon that maintained the same aesthetic style, ensuring consistency with the original logo. The new icon not only strengthened the visual identity but also provided a versatile and modern option for use in various formats and devices.",
      "logo_figcaption": "Customized logo.",
      "icon_figcaption": "Customized icon.",
      "ui_title": "UI/UX Frontend",
      "ui_subtitle": "From mobile to desktop: Adaptive prototyping",
      "ui_description": "The initial mobile prototype provided a solid foundation to start with. After extracting and synthesizing the visual system, I redesigned the mobile interface, increasing text size for better readability and adapting each element to ensure an optimal user experience. I then expanded the design to larger devices, creating an adaptive flow that spanned from tablets to desktop screens. This process of frontend adaptation presented challenges due to the ambitious nature of the original interface, but the final result was a visually consistent and well-executed solution across all platforms.",
      "ui_subtitle_2": "UX and best practices in every component of the application",
      "ui_description_2": "After understanding the client's needs and their vision for a highly visual prototype, it was time to bring it to life. My challenge was to ensure that everything remained functional and intuitive while using Ionic components, without compromising the original look and feel. I crafted the Customized components with a keen eye for design best practices and user experience principles. After all, this is a training platform, and our goal was to make it not just easy to use, but also visually engaging and inviting.",
      "ui_prototype_web": "UI/UX web light and dark mode. Homepage 👆 🖥️",
      "learn_title": "What did I learn?",
      "learn_subtitle": "The value of adapting the client's vision",
      "learn_description": "In the Customized project, learning to appreciate the client's preferences and specifications was essential. Following their proposals and maintaining constant communication ensured that the final product met their expectations and faithfully reflected their vision. This approach not only guaranteed client satisfaction but also streamlined the design process, allowing me to adjust and improve each detail to achieve a solid and cohesive result.",
      "learn_subtitle_2": "Boosting my frontend skills with Ionic and Angular",
      "learn_description_2": "Working on this project was an opportunity to deepen my frontend development skills, especially using Ionic with Angular. Facing the challenge of building an adaptable, high-quality interface for different devices and resolutions helped me improve my competencies and optimize workflows in cross-platform application development.",
      "learn_subtitle_3": "Applying and adapting usability and UX concepts",
      "learn_description_3": "The initial Adobe XD prototype provided by the client served as a visual guide that I sketched and adapted throughout the process. Each component was adjusted to meet usability standards and deliver a smooth and consistent user experience. This phase was crucial to ensure that all design elements were intuitive and functional, resulting in a final product that offered a satisfying interaction."
    },
    "eva": {
      "name": "EVA",
      "main_lead": "A portal for evaluating educational mobile apps.",
      "introduction": "Assessing educational value in the digital age",
      "description": "<p>EVA is a specialized directory for evaluating educational mobile applications, where users can find ratings and reviews based on criteria such as usability, gamification, and accessibility. The project's goal was to provide a valuable resource for educators, students, and parents by offering a detailed analysis of each app's educational quality.</p><p>The design approach focused on creating a modern and accessible interface, adapted for both mobile devices and larger screens, and developing a visual certification system that highlighted the apps that best met the established quality standards. This project was an opportunity to solidify my skills in branding and UI/UX, applying innovative design concepts that enhance the user experience.</p>",
      "action_text": "Explore the website <i class=\"baicon-arrow-right\"></i>",
      "role_1": "Product Design",
      "role_2": "Branding",
      "role_3": "After Effects",
      "role_4": "Frontend",
      "client_1": "<a href=\"https://grupoitaca.ugr.es\" target=\"_blank\" class=\"text-dark\">Ítaca Research Group</a> at the University of Granada.",
      "date": "2020 - 2021",
      "figcaption_1": "First logo versions and accreditation seal.",
      "visual_identity_title": "Visual Identity",
      "visual_identity_subtitle": "Conveying the spirit of gamification",
      "visual_identity_description": "<p>From the start, my goal was to create a visual identity that represented the idea of exploration and assessment. I chose a color palette with purple tones, as they symbolize creativity and gamification—key characteristics of the project. I complemented the palette with bright accents to highlight interactive elements in the interface.</p><p>For typography, I selected a modern and readable style to ensure clarity on any device. The combination of these elements resulted in a cohesive visual identity that reinforces the concept of educational evaluation, making the portal intuitive and appealing to users.</p>",
      "logo_title": "Logo",
      "logo_subtitle": "Merging progress and communication",
      "logo_description": "The design of the EVA logo was inspired by the idea of connection and evaluation. The primary part of the imagotype is the icon: a bar that symbolizes progress and assessment, accompanied by a shape that evokes a compass. This design is complemented by a figure resembling a speech bubble, suggesting communication and community. The choice of contrasting colors and geometric shapes reinforces the idea of an interactive and modern portal, with the icon being the element that best captures the essence of the brand.",
      "logo_figcaption": "EVA logo.",
      "icon_figcaption": "EVA icon.",
      "video_title": "The perfect finishing touch!",
      "video_subtitle": "A video that brings EVA to life",
      "video_description": "To complete the project, I took on the challenge of creating a promotional video from scratch, where I could leave my personal mark. Using my experience with After Effects, I searched for free templates as a starting point to adapt the visual identity and design elements of EVA. The final video not only demonstrates how the portal works but also captures the essence of the project, highlighting the importance of educational evaluation in a dynamic and engaging way. Every detail was carefully crafted to bring the platform to life on screen, clearly communicating its value and purpose. It was the perfect finishing touch, and a project that I’m truly proud of.",
      "video_figcaption": "EVA promotional video. Created with After Effects.",
      "learn_title": "What did I learn?",
      "learn_subtitle": "Adapting the client's vision to the educational context",
      "learn_description": "Developing EVA allowed me to appreciate the importance of understanding the specific needs of the client and the end users. Listening to their specifications was key to creating a product that met their expectations and offered a valuable experience to the educational community. The combination of gamification and educational criteria was a rewarding challenge that strengthened my focus on creating useful solutions.",
      "learn_subtitle_2": "Enhancing my knowledge of branding and adaptive design",
      "learn_description_2": "Working on EVA's visual identity challenged my skills in branding and adaptive interface design. I managed to merge the design aesthetics with principles of gamification and evaluation, creating a solid visual system reflected in the portal's usability.",
      "learn_subtitle_3": "Practical application of evaluation and accessibility concepts",
      "learn_description_3": "The project provided an opportunity to apply advanced concepts in accessibility and usability, essential for an educational portal. Every detail, from color selection to information structure, was adjusted to meet high-quality standards and ensure an optimal user experience."
    }
  },
  "old_projects": {
    "title": "Old Projects",
    "description": "Here, I wanted to make a quick compilation of all the work I did in the past. There are quite a few, and I have selected those most important to me.",
    "subtitle": "A bit of history",
    "other_old_projects": "Other old projects",
    "all": "All",
    "branding": "Branding",
    "graphic": "Graphic Design",
    "web": "Web",
    "the_challenge": "The Challenge",
    "the_idea": "The Idea",
    "the_solution": "The Solution",
    "observador": {
      "title": "El Observador",
      "intro": "Issue number 1 compiling articles published in El Observador de Castilla-La Mancha. A special edition for the first graduating class of the Faculty of Journalism at the University of Castilla-La Mancha.",
      "role_1": "Product Design",
      "role_2": "Editor",
      "role_3": "Layout Designer",
      "role_4": "Coordinator",
      "client_1": "UCLM",
      "client_2": "www.observador.uclm.es",
      "date": "2014",
      "idea": "The idea arose during my internship at CIDI (Center for Image Research and Development) at UCLM. I discovered that editorial layout and graphic design evoked positive emotions and feelings in me. At that time, I was constantly inspired by observing magazines in waiting rooms, friends' houses, and restaurant menus. This inspiration led me to propose to Julio, my tutor and friend during my academic training, the layout of a complete magazine with reports from my classmates, as a culmination of our first journalism class in Cuenca.",
      "challenge": "The challenge was coordinating all my classmates to deliver quality material within the established deadlines. It was crucial to take care of formats, length, and image quality to ensure a professional final product. I assumed the role of Product Manager and team leader, effectively organizing the class and exceeding the expectations of teachers and classmates.",
      "solution": "I tackled the challenge with respect and professionalism, maintaining a pleasant atmosphere thanks to my usual jokes and providing clear instructions on technical details. I offered my help to anyone who needed it and took care of correcting any errors, ensuring that each contribution met the necessary quality standards for the magazine's publication."
    },
    "psicoesfera": {
      "title": "Psicoesfera",
      "intro": "Psicoesfera is a magazine of pulp stories and illustration. As a co-founder alongside Beni Díaz, I was in charge of the magazine's editing, layout, and coordination of the entire team of illustrators. We used WordPress for the web, InDesign for the layout, and FlipBook to view the digital magazine. The project was altruistic and did not generate income, but we organized T-shirts and great parties where we held concerts or screenings. We even printed a special Halloween issue with horror stories.",
      "role_1": "Co-founder",
      "role_2": "Editor",
      "role_3": "Layout Designer",
      "role_4": "Illustrators Coordinator",
      "client_1": "Own Project",
      "date": "2014",
      "idea": "The idea was to create a magazine that brought together pulp stories and illustrations, giving space to artists who worked for the love of art. As a co-founder, my role included editing, layout, and coordinating the creative team.",
      "challenge": "The challenge was coordinating a large number of people who contributed exceptional work altruistically, without financial remuneration.",
      "solution": "I took on the responsibility of leading the team and handling all the technical development of the product, ensuring the project's progress and organizing events to promote it."
    }
  }
}
