{
  "meta": {
    "description": "Álex Bayo Saiz es un diseñador de productos digitales con amplia experiencia en programación y principios de diseño interactivo. Está abierto a colaborar en proyectos de aplicaciones y sitios web para startups, marcas y emprendedores, ofreciendo soluciones innovadoras y centradas en el usuario.",
    "keywords": "diseño de producto, diseño de interfaces, diseño interactivo, experiencia de usuario, interfaz de usuario, diseño web, diseño responsive, líder de equipo, usabilidad, investigación de usuario",
    "og_title": "Álex Bayo Saiz - Digital Product Designer",
    "about": {
      "title": "Álex Bayo Saiz | Sobre mí"
    },
    "home": {
      "title": "Álex Bayo Saiz | Inicio"
    },
    "kikoto": {
      "description": "Álex Bayo Saiz - Kikoto, un portal de compra de billetes de ferry y software multiplataforma creado con mimo y dedicación."
    },
    "studeng": {
      "description": "Álex Bayo Saiz - Studeng+, una aplicación para hacer que el aprendizaje sea emocionante y divertido."
    }
  },
  "common": {
    "loading": "Cargando...",
    "loading_prototype": "Cargando prototipo...",
    "video_no_support": "Tu navegador no soporta el elemento de vídeo.",
    "title": "Mi portafolio",
    "projectOverview": "Proyectos destacados",
    "scroll": "Scroll para ver más",
    "back": "Inicio",
    "go_back": "Atrás",
    "about_project": "Sobre el proyecto",
    "open_case_study": "Descubrir el proyecto",
    "role": "Rol",
    "client": "Cliente",
    "date": "Fecha",
    "typography": "Tipografía",
    "colors": "Colores",
    "expand": "Ampliar",
    "view_prototype": "Ver prototipo<span class=\"icon\">👆</span>",
    "let_start_title": "¡Trabajemos juntos!",
    "let_start_subtitle": "¡Empecemos a crear experiencias y productos excelentes!",
    "let_start_text": "Transformemos ideas en productos que no solo luzcan increíbles, sino que funcionen a la perfección. ¿Listo para crear algo innovador? Estaré encantado de que nos pongamos en contacto. Escríbeme a <a href=\"mailto:alexbayosaiz@gmail.com\" class=\"text-light\">alexbayosaiz@gmail.com</a> y empecemos una aventura creativa increíble.",
    "old_projects": "Proyectos antiguos",
    "404_title": "Error 404",
    "404_subtitle": "La página que estás buscando ha sido movida a otro lugar, eliminada o nunca ha existido.",
    "404_button": "Ir a inicio"
  },
  "about": {
    "hi": "Hola, soy Álex",
    "intro": "Diseño productos digitales y marcas para clientes de todo tipo. También trabajo como freelance aplicando toda mi creatividad.",
    "lead1": "Soy diseñador de productos digitales.",
    "lead2": "Con amplia experiencia en programación.",
    "lead3": "Resido en España y quiero crear productos.",
    "at_work": "En el trabajo",
    "at_work_description": "<p>Mi enfoque comienza con una conversación cercana, donde me interesa conocer la historia del cliente y sus motivaciones. Esto me permite trazar un mapa mental claro de los desafíos que el proyecto busca resolver. A partir de ahí, hago muchas preguntas y presento bocetos o wireframes sencillos para visualizar la idea inicial y asegurar que estamos alineados.</p><p>Con esta base, desarrollo el sistema de diseño principal, donde la prioridad es establecer un branding sólido y un logotipo que resuene tanto conmigo como con el cliente, marcando el inicio de una identidad robusta. Luego, selecciono el stack tecnológico adecuado y paso a la fase de prototipado de alta fidelidad, generalmente en Figma, para crear un mockup que pueda ser testeado y validado.</p><p>A partir de ahí, continúo el viaje hacia la creación del producto final, asegurando que cada etapa esté en sintonía con la visión y las expectativas del cliente.</p>",
    "at_work_figcaption": "Cartel <a href='https://www.escuelaartegranada.com/Noticia-773-Charla-Web-Union-Granada' target='_blank'><i>Frontend y buenas prácticas</i></a> de <a href='http://webuniongranada.com/' target='_blankk'>Web Union Granada</a>. 2018.",
    "at_work_figcaption1": "Charla <a href='https://www.escuelaartegranada.com/Noticia-773-Charla-Web-Union-Granada' target='_blank'><i>Frontend y buenas prácticas</i></a> en <a href='http://webuniongranada.com/' target='_blank'>Web Union Granada</a>. 2018.",
    "at_work_figcaption2": "Comienzo con Everyware Technologies. 2018. <a href='https://www.escuelaartegranada.com/Noticia-785-Alejandro-Bayo---Everyware-Technologies' target='_blank'>Ver noticia</a>.",
    "at_life": "En mi vida personal",
    "at_life_description": "<span class='fs-1'>🏔️</span><p>Practico deporte desde los 7 años; competí en fútbol, pero los deportes individuales siempre me han atraído más, especialmente aquellos que me conectan con la naturaleza. El trail running es mi escape favorito: me brinda el espacio que necesito para respirar y pensar. También disfruto de la bicicleta, tanto de montaña como de carretera, y mantengo mi forma física para cuidar mi salud y energía.</p><span class='fs-1'>🍔</span><p>Me encanta comer (las hamburguesas son mi debilidad), y cuando el tiempo me lo permite, disfruto cocinando mis comidas favoritas, siempre en primera posición el cocido de mi madre.</p><span class='fs-1'>🍻</span><p>En lo social, siempre soy el organizador, el que tira de los amigos y hace que todo salga bien. Si la fiesta es buena, soy el alma. Me encanta hablar y liar a todo el mundo, es algo que me caracteriza. Me gusta la cerveza y el vino en un bar con música rock mientras juego al futbolín.</p><span class='fs-1'>🎤</span><p>Llevo 16 años haciendo beatbox, y es una parte fundamental de mi vida. Ritmo y música me acompañan en cada lugar: en la oficina, en la calle o en la bicicleta. También disfruto del dibujo, una pasión desde la infancia que siempre me ha permitido concentrarme y mejorar.</p>"
  },
  "projects": {
    "kikoto": {
      "name": "Kikoto",
      "main_lead": "Un portal para comprar billetes de ferry creado con mimo y dedicación.",
      "introduction": "Creando de la nada un portal de compra de billetes de ferry.",
      "description": "Hace unos años partimos hacia un viaje. Uno de nuestros clientes quiso realizar un software alrededor de la venta de billetes de ferry. En ese momento había algunas empresas de la competencia que ya ofrecían este servicio, por lo tanto era el momento de buscar la excelencia y la diferenciación. <br><br> Desde este momento me pongo manos a la obra y comienzo un dedicado diseño de todo el producto. Ha sido un largo viaje pero finalmente llegamos a nuestro destino. <br><br>Kikoto, el portal dedicado a la intermediación de la venta online de reservas de billetes de barco de diferentes navieras de ámbito nacional para viajes dentro del territorio nacional e internacional.",
      "action_text": "Ir al sitio web <i class=\"baicon-arrow-right\"></i>",
      "role_1": "Diseño de marca",
      "role_2": "UI/UX",
      "role_3": "Diseño de producto",
      "role_4": "Frontend",
      "client_1": "Kikoto",
      "date": "2020 - Actualidad",
      "figcaption_1": "Imagen nocturna del proyecto Kikoto. Diseñado por </span><a href=\"https://www.freepik.es/\" target=\"_blank\">Freepik</a>.",
      "figcaption_2": "Ilustración decorativa de un atardecer en una costa con faro. Diseñado por </span><a href=\"https://www.freepik.es/\" target=\"_blank\">Freepik</a>.",
      "visual_identity_title": "Identidad visual",
      "visual_identity_subtitle": "Creando la marca Kikoto",
      "visual_identity_description": "Desarrollé una marca sólida y distintiva desde cero, prestando especial atención a cada detalle. Seleccioné una paleta de colores cuidadosamente elegida y una tipografía redondeada para reflejar la esencia del océano y el mar. El resultado es una identidad visual reconocible, con una palabra clave impactante, una voz definida, ilustraciones únicas y valores sólidos que refuerzan la marca.",
      "logo_title": "Logotipo",
      "logo_subtitle": "Encontrando el rumbo",
      "logo_subtitle2": "¿Hacia dónde vamos?",
      "logo_description": "En un principio, se me encargó diseñar el logotipo para una empresa de ferries llamada Kikoto. Mis primeras ideas exploraron el uso de un timón combinado con una tipografía redondeada para reflejar el espíritu náutico. Sin embargo, el cliente fue claro en una única instrucción: ‘No queremos el típico timón’. Tras este feedback, y después de algunas iteraciones, se me ocurrió una versión definitiva del logotipo que integrara un icono de una brújula moderno que puede recordar al puntero de un ordenador. ¡Nuestro software ya tenía rumbo!",
      "first_versions": "Primeras versiones",
      "logo_figcaption": "Logo de Kikoto.",
      "ui_title": "Diseño UI/UX",
      "ui_subtitle": "Prototipado responsive según la tecnología usada en el frontend",
      "ui_description": "El mayor desafío fue adaptar el diseño, la experiencia de usuario y la usabilidad al stack frontend que estábamos utilizando. Trabajamos con un entorno de Progressive Web App (PWA) multiplataforma, usando Ionic y Angular como framework frontend. Gracias a mi experiencia en codificar con los componentes de Ionic y personalizar la maquetación en CSS, tenía claro los límites y posibilidades del prototipado. Así comenzó la iteración del sistema de diseño UI/UX, una fase que disfruté enormemente, aunque también fue la más desafiante.",
      "ui_prototype_web": "Prototipo web (interactivo) 👆 🖥️",
      "ui_prototype_mobile": "Prototipo móvil (interactivo) 👆 📱",
      "ui_figcaption_desktop": "Primera versión del prototipo web en Adobe XD.",
      "ui_figcaption_mobile": "Primera versión del prototipo móvil en Adobe XD.",
      "hurry_title": "Voy con prisa",
      "hurry_subtitle": "La diferenciación frente a la competencia",
      "hurry_description": "Había que plantear una funcionalidad estrella que permitiera comprar tu billete de ferry en el menor tiempo posible, de manera fácil e intuitiva. Tomé como inspiración el diseño que utiliza Airbnb en su flow para buscar alojamientos, un modal que se presenta desde la parte inferior de la pantalla y que permite interactuar en un proceso lineal organizado en pasos. El flujo se presentaría desde la acción del botón central de la barra de navegación inferior, tomando el protagonismo total de la aplicación y haciendo evidente que el producto giraba en torno a esta funcionalidad. En el contenido, el usuario encontraría los datos que tiene guardados en sus ajustes de cuenta, haciéndolo todo más rápido y fácil. ¿Mola, eh?",
      "hurry_figcaption": "Llamada a la acción de la funcionalidad <span class=\"fst-italic\">Voy con prisa</span> de\n la web de Kikoto.",
      "hurry_video_title": "Funcionalidad <span class=\"fst-italic\">Voy con prisa</span> en la aplicación iOS ",
      "hurry_video_figcaption": "Vídeo grabado directamente en mi teléfono usando la app.",
      "illustrations_title": "Sistema de ilustraciones personalizadas",
      "illustrations_subtitle": "Creación de un lenguaje visual atractivo, persuasivo y consistente",
      "illustrations_description": "Las ilustraciones utilizadas en la app se basan en recursos de Freepik, adaptados cuidadosamente para integrarse con la paleta de colores de la aplicación. Este sistema de ilustraciones es transversal a lo largo del software, creando una identidad visual coherente y reforzando la experiencia del usuario. Las ilustraciones no solo embellecen la interfaz, sino que también captan la atención de los usuarios potenciales en las tiendas de aplicaciones, fortaleciendo el engagement y la presencia visual del producto.",
      "illustrations_section": "Ilustraciones del proyecto",
      "stores_title": "¡Nos lo llevamos a las stores!",
      "stores_subtitle": "Adaptación visual para iOS y Google Play con un enfoque multilingüe",
      "stores_description": "Para lanzar la app en las tiendas, diseñé una serie de screenshots que cuentan una historia visual atractiva, alineada con el sistema de diseño general de la aplicación. Cada captura de pantalla fue creada cuidadosamente para captar la atención de los usuarios y reflejar la identidad de la app. El proceso incluyó la adaptación para iPhone, iPad y dispositivos Android, cumpliendo con los requisitos de las tiendas de Apple y Google Play. Además, cada conjunto de diseños fue traducido y ajustado a tres idiomas: español, inglés y francés, lo que añadió un reto logístico pero esencial para llegar a una audiencia global.",
      "stores_section_ios": "Capturas de pantalla para Apple Store (iPhone y iPad)",
      "stores_section_android": "Capturas de pantalla para Google Play",
      "learn_title": "¿Qué aprendí?",
      "learn_subtitle": "Crear una identidad desde cero es un reto y una oportunidad",
      "learn_description": "Este proyecto me permitió solidificar mi experiencia en la creación de una imagen corporativa completa, desde el concepto hasta la aplicación en diferentes soportes, utilizando recursos gráficos propios.",
      "learn_subtitle_2": "El feedback del cliente es clave, pero el usuario final manda",
      "learn_description_2": "Aprendí a manejar el feedback del cliente, ajustando cambios y soluciones que mantuvieran siempre en mente las necesidades del usuario final.",
      "learn_subtitle_3": "Inspirarse en la competencia es inteligente",
      "learn_description_3": "Observar grandes marcas como Airbnb, Vueling o SkyScanner me demostró que inspirarse en empresas consolidadas no solo es válido, sino beneficioso para mejorar las soluciones de diseño."
    },
    "studeng": {
      "name": "Studeng+",
      "main_lead": "Una aplicación para hacer que el aprendizaje sea emocionante y divertido.",
      "introduction": "Un aprendizaje emocionante",
      "description": "<p>Studeng+ supuso un emocionante viaje hacia un aprendizaje transformador. Desde el principio, nos propusimos crear una aplicación que no solo enseñara, sino que también inspirara y motivara a estudiantes de todas las edades. En este entorno educativo, los retos diseñados con cuidado se combinan con modelos 3D y elementos de gamificación para hacer del aprendizaje una experiencia divertida y atractiva.</p><p>Lo más gratificante de este proyecto ha sido la libertad total para diseñar desde cero, lo que me ha permitido explorar nuevas ideas y enfoques. Además, me enorgullece poder ayudar a estudiantes y MENAS, contribuyendo a su desarrollo personal y académico.</p><p>Con Studeng+, cada desafío se convierte en una oportunidad de aprender y crecer, llevando el aprendizaje a un nuevo nivel.</p>",
      "action_text": "Ir al sitio web <i class=\"baicon-arrow-right\"></i>",
      "role_1": "Diseño de producto",
      "role_2": "Branding",
      "role_3": "UI/UX",
      "role_4": "Frontend",
      "client_1": "<a href=\"https://grupoitaca.ugr.es\" target=\"_blank\" class=\"text-dark\">Grupo de Investigación Ítaca</a> de la Universidad de Granada.",
      "date": "Marzo 2023 - Actualidad",
      "figcaption_1": "Recurso del proyecto Studeng+.",
      "visual_identity_title": "Identidad visual",
      "visual_identity_subtitle": "Creando la marca Studeng+",
      "visual_identity_description": "<p>Desde el inicio del proyecto, mi objetivo fue crear una experiencia de aprendizaje que trascienda las aulas. Elegí un verde vibrante como color primario, simbolizando el crecimiento y el aprendizaje, complementado con un morado que evoca tranquilidad y reflexión ante los desafíos.</p><p>La paleta de colores pastel que utilicé está inspirada en las líneas de Material Design 3 y Material You, lo que permite una interacción visualmente agradable y moderna. Las formas redondeadas y los recursos en 3D respaldan los avatares personalizables, creando una conexión emocional con los usuarios.</p><p>Además, seleccioné Nunito, una tipografía que recuerda a las letras de cómics, diseñada para ser amigable y accesible, ideal para niños y jóvenes. El resultado es una identidad visual cohesiva y atractiva, que no solo refuerza la marca, sino que también fomenta un ambiente de aprendizaje positivo y motivador.</p>",
      "logo_title": "Logotipo",
      "logo_subtitle": "Una idea simple que funciona",
      "logo_description": "Cuando existe libertad para desarrollar una idea, los resultados suelen ser positivos. Para el logotipo de Studeng, me inspiré en un entorno educativo y de aprendizaje, optando por una tipografía que transmitiera ese carácter. Elegí Baloo, una tipografía con un estilo redondeado y robusto, casi caligráfico, pero perfectamente adaptado al mundo del software. Su diseño recuerda a aquellos estudianttes que dibujaban esas letras perfectamente iguales en altura y muy redonditas, llenas de personalidad, ¿no?. Además, incorporé un detalle sobre la letra 'g' que imita un birrete, reforzando así la conexión con el ámbito educativo.",
      "logo_figcaption": "Logo de Studeng. v1",
      "logo2_title": "Rebranding",
      "logo2_subtitle": "Pequeñas adaptaciones en el diseño original",
      "logo2_description": "En el mundo del software, a veces el cliente necesita realizar cambios o adaptaciones en el nombre de su marca, ya sea por razones legales o de otro tipo. Estos ajustes pueden interferir con la idea y el diseño originales. En este caso, se requería añadir el concepto de <i>Más</i> al nombre del software, de manera que fuera visible y se integrara de forma natural en la identidad del producto. Dado que la simplicidad fue el punto fuerte del diseño inicial, decidí seguir ese mismo enfoque minimalista para esta adaptación.",
      "logo2_figcaption": "Logo de Studeng+. v2",
      "ui_title": "Diseño UI/UX sobre el frontend",
      "ui_subtitle": "Prototipado directamente en el frontend",
      "ui_description": "<p>Con los plazos ajustados y un presupuesto limitado que no permitía una primera fase de prototipado en Figma, el proceso de diseño tuvo que ser más ágil y adaptativo. Fue necesario construir el prototipo directamente mientras se codificaba el frontend utilizando Ionic y Angular. Este enfoque presentó un auténtico desafío, ya que complicó la tarea de aplicar un sistema de diseño coherente y que funcionara de manera óptima en todas las plataformas. El producto final debía ser una PWA con salida a la App Store, lo que requería un cuidado especial en la consistencia visual y funcional.</p><p>Para el diseño, me inspiré en las nuevas tendencias propuestas por Material Design 3, que recién habían aparecido. Como al inicio del proyecto se había optado por Materialize, basado en Material Design 2, la transición hacia la siguiente evolución del sistema tenía todo el sentido para mí. Encontré en las nuevas paletas y colores pastel una sintonía perfecta con la identidad del producto que quería lograr: tonos que evocan el entorno escolar, como el verde pastel de las paredes de las aulas, el verde oscuro de las pizarras, y los tonos naturales de mesas y sillas... ¡Todo!</p><p>Fue entonces cuando comencé a dar vida al diseño, buscando capturar la esencia de ese ambiente a través de una interfaz moderna y amigable.</p>",
      "ui_prototype_web": "UI/UX web modo claro y oscuro. Página de inicio 👆 🖥️",
      "ui_prototype_mobile": "UI/UX de la app móvil de iOS. Grabado en mi teléfono. 👆 📱",
      "illustrations_title": "Sistema de ilustraciones con estética 3D",
      "illustrations_subtitle": "Creación de un lenguaje visual moderno, consistente y llamativo",
      "illustrations_description": "Las ilustraciones utilizadas en la app, basadas en recursos y bancos gratuitos, han sido adaptadas cuidadosamente para encajar con el sistema simple del diseño. Lo que realmente destaca es la incorporación de elementos en 3D, que extienden el lenguaje visual y crean una cohesión perfecta con la inclusión del avatar personalizable, desarrollado en tres dimensiones por una empresa externa. Esta integración no solo aporta coherencia al producto, sino que también le confiere un atractivo visual que resulta irresistible para los niños. Las ilustraciones 3D no solo embellecen la interfaz, sino que, junto con el avatar, generan una experiencia inmersiva que engancha a los usuarios a explorar y jugar, reforzando la identidad del producto.",
      "video_title": "¡El toque final perfecto!",
      "video_subtitle": "Un vídeo que da vida a Studeng+",
      "video_description": "Para poner la guinda al proyecto, me sumergí en la creación de un vídeo de promoción completamente desde cero. Aprovechando mi experiencia con After Effects, busqué plantillas gratuitas que pudieran servir de base para adaptar todo el sistema de diseño y lenguaje visual del producto. El resultado fue un vídeo magnífico que no solo explica cómo funciona Studeng+, sino que también refleja la esencia del producto de manera dinámica y atractiva. Cada detalle del diseño cobró vida en pantalla, transmitiendo de forma clara y visualmente impactante la propuesta de valor del software. Sin duda, fue el broche de oro, un logro del que me siento realmente orgulloso.",
      "video_figcaption": "Vídeo de promoción de Studeng+. Creado con After Effects.",
      "learn_title": "¿Qué aprendí?",
      "learn_subtitle": "Un sistema de diseño que fusiona lo nuevo y lo clásico",
      "learn_description": "El desarrollo del proyecto me permitió diseñar un sistema visual integrando elementos completamente nuevos para mí, como el uso del 3D para crear recursos coherentes y dinámicos. Además, las pautas de Material Design 3 aportaron un enfoque moderno, ayudándome a construir una armonía visual sólida.",
      "learn_subtitle_2": "Mejoras en la codificación y el prototipado en tiempo real",
      "learn_description_2": "Al no disponer de tiempo para un prototipado en Figma, el proceso de diseño tuvo que realizarse directamente sobre el frontend con Ionic y Angular. Esto no solo me obligó a refinar mis habilidades de codificación, sino también a desarrollar soluciones creativas en el camino para garantizar que el sistema de diseño funcionara perfectamente en todas las plataformas.",
      "learn_subtitle_3": "Ampliando el alcance con habilidades adicionales",
      "learn_description_3": "El proyecto también me permitió aprovechar mis conocimientos en otras tecnologías para aportar una solidez integral al producto. La creación del vídeo de promoción en After Effects no solo reforzó la identidad visual del proyecto, sino que también le dio un valor añadido, destacando la presentación del software con un toque profesional y atractivo."
    },
    "aumentur": {
      "name": "Aumentur",
      "main_lead": "Una aplicación para descubrir el mundo a través de la realidad aumentada.",
      "introduction": "Exploración inmersiva y aprendizaje",
      "description": "<p>Aumentur ha sido una experiencia única en el ámbito del aprendizaje inmersivo y la exploración cultural. Desde el principio, el objetivo fue desarrollar una aplicación que permitiera a los usuarios experimentar el arte, la historia y la cultura de manera innovadora, utilizando la realidad aumentada para crear una conexión profunda con el entorno.</p><p>La libertad para experimentar con nuevas tecnologías fue una de las partes más gratificantes del proyecto, permitiéndome implementar soluciones creativas y explorar enfoques innovadores en la experiencia de usuario. La aplicación se convierte así en una herramienta para transformar la manera en que los usuarios descubren y aprenden sobre el mundo que les rodea.</p>",
      "action_text": "Visita el sitio web <i class=\"baicon-arrow-right\"></i>",
      "role_1": "Diseño de producto",
      "role_2": "Branding",
      "role_3": "UI/UX",
      "client_1": "<a href=\"https://www.aumentur.app\" target=\"_blank\" class=\"text-dark\">Aumentur</a>",
      "date": "2020 - 2024",
      "figcaption_1": "Recurso del proyecto Aumentur.",
      "visual_identity_title": "Identidad visual",
      "visual_identity_subtitle": "Un color y una tipografía acertadas",
      "visual_identity_description": "<p>Desde el inicio del proyecto, mi objetivo fue crear una identidad visual que no solo transmitiera exploración y descubrimiento, sino que también atrajera la atención de los usuarios desde el primer momento. Para ello, elegí el color naranja como base de la paleta, ya que se le atribuyen propiedades para estimular la actividad mental y fomentar la interacción social. Estos tonos vibrantes y llenos de energía resultan perfectos para una aplicación de turismo, proporcionando un punto de partida ideal para captar la curiosidad y el interés del usuario.</p><p>Además, opté por utilizar una única tipografía, Ubuntu, que demostró ser versátil tanto para el logotipo como para el diseño de la interfaz. Su estilo moderno y legible encajó perfectamente en el entorno digital, ofreciendo una solución integral que facilitó la creación de una identidad visual coherente y atractiva para Aumentur. Con estos elementos simples, pero cuidadosamente seleccionados, fue posible construir una experiencia visual que refleja la esencia dinámica de la aplicación.</p>",
      "logo_title": "Logotipo",
      "logo_subtitle": "Una representación visual de la exploración",
      "logo_description": "<p>El diseño del logotipo de Aumentur se inspira en la idea de una brújula que simboliza la conexión y la búsqueda de nuevas experiencias. El isotipo es el elemento central del logotipo: una brújula estilizada dentro de un bocadillo de diálogo, que evoca la comunicación, la comunidad y la interacción. Las líneas que imitan las barritas de conexión en la brújula sugieren la idea de estar conectado al conocimiento, como si se tratara de una señal de WiFi que nos guía hacia la exploración.</p><p>La elección de formas geométricas y colores contrastantes asegura que el logotipo sea fácilmente reconocible, destacando la esencia del descubrimiento. La tipografía, que acompaña al isotipo, refuerza la identidad visual sin restar protagonismo al símbolo central, logrando un equilibrio entre simplicidad y significado.</p>",
      "logo_figcaption": "Logotipo de Aumentur.",
      "ui_title": "Diseño UI/UX",
      "ui_subtitle": "Prototipado pensando en una experiencia innmersiva para el usuario",
      "ui_description": "<p>Tuve la libertad total para dar forma a las especificaciones del cliente, lo cual me permitió abordar este proyecto con una visión integral y creativa. La aplicación debía ofrecer una experiencia de usuario completa y versátil, comunicándose de manera inteligente con los monumentos. Para ello, se incorporaron funciones que permitían la interacción a través del escaneo de códigos QR, dispositivos de proximidad, seguimiento en el mapa, audiodescripciones, y visualizaciones en 3D de los puntos de interés.</p><p>El desafío no se limitaba solo a implementar estas funciones; también consistía en organizar una gran cantidad de información de manera accesible y atractiva. La aplicación incluía detalles sobre el progreso de la visita, hitos, duración, precios, y la posibilidad de acceder a todo en varios idiomas. Fue un reto apasionante que me permitió crear una experiencia completa, asegurando que cada función y flujo de trabajo cumpliera con las expectativas del usuario final y maximizara su experiencia de exploración.</p>",
      "ui_prototype_mobile": "Prototipo móvil (interactivo). 👇 📱",
      "ui_figcaption_mobile": "Primera versión del prototipo móvil en Adobe XD.",
      "ui_prototype_mobile2": "UI/UX de la app móvil de iOS. Grabado en mi dispositivo. 👇 📱",
      "ui_figcaption_mobile2": "Vídeo grabado directamente en mi teléfono usando la app.",
      "learn_title": "¿Qué aprendí?",
      "learn_subtitle": "Fusionando el mundo real con la experiencia digital",
      "learn_description": "El diseño de Aumentur implicó combinar y sintetizar múltiples funcionalidades y requisitos del cliente, integrando elementos del mundo real con la experiencia de un usuario en su teléfono. Cada función, desde el escaneo de códigos QR y dispositivos de proximidad hasta el seguimiento en el mapa y las audiodescripciones, se entrelazó para crear una experiencia inmersiva y coherente que facilitara la exploración y el aprendizaje.",
      "learn_subtitle_2": "El valor del prototipado en Adobe XD",
      "learn_description_2": "Trabajar con una fase de prototipado en Adobe XD resultó ser una de las decisiones más acertadas. Me permitió obtener feedback valioso tanto del cliente como del equipo de desarrollo, lo que aseguró una alineación total desde el principio. El prototipo no solo sirvió como guía clara para la posterior codificación, sino que también ahorró tiempo y recursos, logrando un producto final de alta calidad con una implementación más ágil y eficiente."
    },
    "customized": {
      "name": "Customized",
      "main_lead": "Formación a medida en diabetes para especialistas en Medicina Interna.",
      "introduction": "Software de formación a medida en Medicina",
      "description": "<p>Para el proyecto Customized, el enfoque principal fue el diseño del frontend, adaptando la idea del cliente y asegurando que la interfaz se viera y funcionara perfectamente tanto en dispositivos móviles como en pantallas grandes. Trabajé en la adaptación del branding y la identidad visual, creando un icono que capturara la esencia del logo propuesto, dándole un toque único.</p><p>El verdadero reto y aprendizaje estuvo en trabajar con Ionic, una tecnología que me permitió llevar la experiencia de usuario a otro nivel. Conseguí crear una interfaz impecable en términos de diseño, funcionalidad y usabilidad, superando las dificultades propias de desarrollar todo el frontend con esta herramienta. Fue una completa adaptación de la visión del cliente plasmada en el producto final.</p>",
      "action_text": "Visita el sitio web <i class=\"baicon-arrow-right\"></i>",
      "role_1": "Diseño de producto",
      "role_2": "Branding",
      "role_3": "UI/UX Frontend",
      "client_1": "<a href=\"https://www.fesemi.org\" target=\"_blank\" class=\"text-dark\">Sociedad Española de Medicina Interna (SEMI)</a>",
      "date": "2021 - 2023",
      "figcaption_1": "Recurso del proyecto Customized.",
      "visual_identity_title": "Identidad visual",
      "visual_identity_subtitle": "Construyendo sobre una base sólida",
      "visual_identity_description": "<p>El cliente proporcionó un prototipo móvil en Adobe XD que sirvió como punto de partida para el desarrollo visual del proyecto. Algunas de las propuestas iniciales tenían un gran potencial, y para asegurar una alineación perfecta con el cliente, decidí mantener el logotipo que proponían, realizando solo algunas variaciones técnicas para optimizar su uso a nivel vectorial. Además, diseñé un icono pequeño en la misma línea estética para complementar la identidad. La paleta de colores y las tipografías originales se conservaron, ya que resultaron ser una excelente base para construir una identidad visual coherente y atractiva.</p>",
      "logo_title": "Logotipo",
      "logo_subtitle": "Refinando el logotipo e integrando un nuevo icono",
      "logo_description": "El logotipo proporcionado por el cliente sirvió como punto de partida, con una propuesta que ya capturaba la esencia de la marca. Realicé algunas mejoras técnicas en el diseño vectorial para optimizarlo y darle un aspecto más pulido. Además, creé un icono complementario que mantenía la misma línea estética, asegurando coherencia con el logotipo original. El nuevo icono no solo reforzó la identidad visual, sino que también proporcionó una opción versátil y moderna para su uso en distintos formatos y dispositivos.",
      "logo_figcaption": "Logotipo de Customized.",
      "icon_figcaption": "Icono de Customized.",
      "ui_title": "UI/UX Frontend",
      "ui_subtitle": "De móvil a escritorio: Un prototipado adaptativo",
      "ui_description": "El prototipado móvil inicial proporcionó una base sólida para comenzar. Tras extraer y sintetizar el sistema visual, rediseñé la interfaz móvil aumentando el tamaño de los textos para mejorar la legibilidad y adaptando cada elemento para garantizar una experiencia de usuario óptima. Luego, amplié el diseño a dispositivos más grandes, creando un flujo adaptativo que abarcaba desde tablets hasta pantallas de escritorio. Este proceso de adaptación en el frontend presentó desafíos debido a la ambición de la interfaz original, pero el resultado final fue una solución visualmente coherente y bien ejecutada en todas las plataformas.",
      "ui_subtitle_2": "UX y buenas prácticas en cada componente de la aplicación",
      "ui_description_2": "Después de comprender las necesidades del cliente y su visión para un prototipo muy visual, llegó el momento de darle vida. Mi reto era lograr que todo fuera funcional e intuitivo utilizando los componentes de Ionic, sin sacrificar el look and feel original. Diseñé los componentes de Customized con un enfoque cuidadoso en las mejores prácticas de diseño y principios de experiencia de usuario. Al fin y al cabo, se trata de una plataforma de formación, y nuestro objetivo era que fuera no solo fácil de usar, sino también visualmente atractiva y acogedora.",
      "ui_prototype_web": "UI/UX web modo claro y oscuro. Página de inicio 👆 🖥️",
      "learn_title": "¿Qué aprendí?",
      "learn_subtitle": "El valor de adaptar la visión del cliente",
      "learn_description": "En el proyecto de Customized, aprender a valorar el gusto y las especificaciones del cliente fue esencial. Seguir sus propuestas y mantener una comunicación constante aseguró que el producto final cumpliera con sus expectativas y reflejara fielmente su visión. Este enfoque no solo garantizó la satisfacción del cliente, sino que también facilitó el proceso de diseño, permitiéndome ajustar y mejorar cada detalle para obtener un resultado sólido y coherente.",
      "learn_subtitle_2": "Impulso en mis conocimientos de frontend con Ionic y Angular",
      "learn_description_2": "Trabajar en este proyecto fue una oportunidad para profundizar en mis habilidades de desarrollo frontend, especialmente utilizando Ionic con Angular. Afrontar el reto de construir una interfaz adaptable y de alta calidad para distintos dispositivos y resoluciones me ayudó a mejorar mis competencias y a optimizar los flujos de trabajo en el desarrollo de aplicaciones multiplataforma.",
      "learn_subtitle_3": "Aplicación y adaptación de conceptos de usabilidad y UX",
      "learn_description_3": "El prototipo inicial en Adobe XD proporcionado por el cliente sirvió como una guía visual que esbocé y adapté a lo largo del proceso. Cada componente fue ajustado para cumplir con los estándares de usabilidad y ofrecer una experiencia de usuario fluida y coherente. Esta fase fue clave para asegurar que todos los elementos del diseño fueran intuitivos y funcionales, resultando en un producto final que brindara una interacción satisfactoria."
    },
    "eva": {
      "name": "EVA",
      "main_lead": "Un portal de evaluación de aplicaciones educativas móviles.",
      "introduction": "Evaluando el valor educativo en la era digital",
      "description": "<p>EVA es un directorio especializado en la evaluación de aplicaciones móviles educativas, donde los usuarios pueden consultar puntuaciones y opiniones basadas en criterios como la usabilidad, la gamificación, y la accesibilidad. El objetivo del proyecto era proporcionar un recurso útil para educadores, estudiantes y padres, ofreciendo un análisis detallado de cada aplicación en función de su calidad educativa.</p><p>El enfoque del diseño se centró en crear una interfaz moderna y accesible, adaptada tanto para dispositivos móviles como para pantallas grandes, y en desarrollar un sistema de certificación visual que destacara aquellas aplicaciones que mejor cumplieran con los estándares de calidad establecidos. Este proyecto fue una oportunidad para solidificar mis habilidades en branding y UI/UX, aplicando conceptos de diseño innovadores que mejoran la experiencia del usuario.</p>",
      "action_text": "Explora el sitio web <i class=\"baicon-arrow-right\"></i>",
      "role_1": "Diseño de producto",
      "role_2": "Branding",
      "role_3": "After Effects",
      "role_4": "Frontend",
      "client_1": "<a href=\"https://grupoitaca.ugr.es\" target=\"_blank\" class=\"text-dark\">Grupo de Investigación Ítaca</a> de la Universidad de Granada.",
      "date": "2020 - 2021",
      "figcaption_1": "Primeras versiones del logotipo y el sello de acreditación.",
      "visual_identity_title": "Identidad visual",
      "visual_identity_subtitle": "Transmitiendo el espíritu de la gamificación",
      "visual_identity_description": "<p>Desde el inicio, mi objetivo fue crear una identidad visual que representara la idea de exploración y valoración. Opté por una paleta de colores en tonos morados, ya que estos simbolizan la creatividad y la gamificación, características clave del proyecto. Complementé la paleta con acentos brillantes para resaltar los elementos interactivos en la interfaz.</p><p>Para la tipografía, elegí un estilo moderno y legible que asegurara la claridad en cualquier dispositivo. La combinación de estos elementos dio lugar a una identidad visual coherente que refuerza el concepto de evaluación educativa y hace que el portal sea intuitivo y atractivo para los usuarios.</p>",
      "logo_title": "Logotipo",
      "logo_subtitle": "Fusionando progreso y comunicación",
      "logo_description": "El diseño del logotipo para EVA se inspiró en la idea de conexión y valoración. La parte principal del imagotipo es el isotipo: una barra que simboliza el progreso y la evaluación, acompañada de una forma que evoca una brújula. Este diseño se complementa con una figura que imita un bocadillo de diálogo, sugiriendo comunicación y comunidad. La elección de colores contrastantes y formas geométricas refuerza la idea de un portal interactivo y moderno, siendo el isotipo el elemento que mejor captura la esencia de la marca.",
      "logo_figcaption": "Logotipo de EVA.",
      "icon_figcaption": "Icono de EVA.",
      "video_title": "¡El toque final perfecto!",
      "video_subtitle": "Un vídeo que da vida a EVA",
      "video_description": "Para completar el proyecto, asumí el desafío de crear un vídeo promocional desde cero, donde pude dejar mi marca personal. Aprovechando mi experiencia con After Effects, busqué plantillas gratuitas como punto de partida para adaptar la identidad visual y los elementos de diseño de EVA. El vídeo final no solo demuestra cómo funciona el portal, sino que también captura la esencia del proyecto, destacando la importancia de la evaluación educativa de una manera dinámica y atractiva. Cada detalle fue cuidadosamente trabajado para dar vida a la plataforma en pantalla, comunicando claramente su valor y propósito. Fue el toque final perfecto y un proyecto del que estoy realmente orgulloso.",
      "video_figcaption": "Vídeo promocional de EVA. Creado con After Effects.",
      "learn_title": "¿Qué aprendí?",
      "learn_subtitle": "Adaptando la visión del cliente al contexto educativo",
      "learn_description": "El desarrollo de EVA me permitió valorar la importancia de comprender las necesidades específicas del cliente y de los usuarios finales. Escuchar sus especificaciones fue clave para crear un producto que cumpliera con sus expectativas y ofreciera una experiencia valiosa a la comunidad educativa. La combinación de gamificación y criterios educativos fue un desafío gratificante que consolidó mi enfoque en la creación de soluciones útiles.",
      "learn_subtitle_2": "Impulso en mis conocimientos de branding y diseño adaptativo",
      "learn_description_2": "Trabajar en la identidad visual de EVA supuso un reto para mis habilidades en branding y en el diseño de interfaces adaptativas. Logré fusionar la estética del diseño con los principios de gamificación y valoración, creando un sistema visual sólido que se refleja en la usabilidad del portal.",
      "learn_subtitle_3": "Aplicación práctica de conceptos de evaluación y accesibilidad",
      "learn_description_3": "El proyecto me brindó la oportunidad de aplicar conceptos avanzados en accesibilidad y usabilidad, esenciales para un portal educativo. Cada detalle, desde la selección de colores hasta la estructura de la información, fue ajustado para cumplir con altos estándares de calidad y garantizar una experiencia de usuario óptima."
    },
    "afinca": {
      "name": "Afinca",
      "main_lead": "Afinca es un marketplace especializado en el mundo rural.",
      "introduction": "Un Airbnb de fincas rurales",
      "description": "Un Airbnb de fincas rurales",
      "action_text": "Ir al sitio web <i class=\"baicon-arrow-right\"></i>",
      "role_1": "Diseño de producto",
      "role_2": "Diseño de marca",
      "role_3": "UI/UX",
      "role_4": "Frontend",
      "client_1": "Afinca",
      "date": "2020 - 2022",
      "figcaption_1": "Imagen nocturna del proyecto Kikoto. Diseñado por ",
      "figcaption_2": "Ilustración decorativa de un atardecer en una costa con faro. Diseñado por ",
      "visual_identity_title": "Identidad visual",
      "visual_identity_subtitle": "Creando la marca Afinca",
      "visual_identity_description": "Desarrollé una marca sólida y distintiva desde cero, prestando especial atención a cada detalle. Seleccioné una paleta de colores cuidadosamente elegida y una tipografía redondeada para reflejar la esencia del océano y el mar. El resultado es una identidad visual reconocible, con una palabra clave impactante, una voz definida, ilustraciones únicas y valores sólidos que refuerzan la marca.",
      "logo_title": "Logotipo",
      "logo_subtitle": "Encontrando el rumbo",
      "logo_subtitle2": "¿Hacia dónde vamos?",
      "logo_description": "En un principio, se me encargó diseñar el logotipo para una empresa de ferries llamada Kikoto. Mis primeras ideas exploraron el uso de un timón combinado con una tipografía redondeada para reflejar el espíritu náutico. Sin embargo, el cliente fue claro en una única instrucción: ‘No queremos el típico timón’. Tras este feedback, y después de algunas iteraciones, se me ocurrió una versión definitiva del logotipo que integrara un icono de una brújula moderno que puede recordar al puntero de un ordenador. ¡Nuestro software ya tenía rumbo!",
      "first_versions": "Primeras versiones",
      "logo_figcaption": "Logo de Kikoto",
      "ui_title": "Diseño UI/UX",
      "ui_subtitle": "Prototipado responsive según la tecnología usada en el frontend",
      "ui_description": "El mayor desafío fue adaptar el diseño, la experiencia de usuario y la usabilidad al stack frontend que estábamos utilizando. Trabajamos con un entorno de Progressive Web App (PWA) multiplataforma, usando Ionic y Angular como framework frontend. Gracias a mi experiencia en codificar con los componentes de Ionic y personalizar la maquetación en CSS, tenía claro los límites y posibilidades del prototipado. Así comenzó la iteración del sistema de diseño UI/UX, una fase que disfruté enormemente, aunque también fue la más desafiante.",
      "ui_prototype_web": "Prototipo web (interactivo) 👆 🖥️",
      "ui_prototype_mobile": "Prototipo móvil (interactivo) 👆 📱",
      "ui_figcaption_desktop": "Primera versión del prototipo web en Adobe XD.",
      "ui_figcaption_mobile": "Primera versión del prototipo móvil en Adobe XD.",
      "hurry_title": "Voy con prisa",
      "hurry_subtitle": "La diferenciación frente a la competencia",
      "hurry_description": "Había que plantear una funcionalidad estrella que permitiera comprar tu billete de ferry en el menor tiempo posible, de manera fácil e intuitiva. Tomé como inspiración el diseño que utiliza Airbnb en su flow para buscar alojamientos, un modal que se presenta desde la parte inferior de la pantalla y que permite interactuar en un proceso lineal organizado en pasos. El flujo se presentaría desde la acción del botón central de la barra de navegación inferior, tomando el protagonismo total de la aplicación y haciendo evidente que el producto giraba en torno a esta funcionalidad. En el contenido, el usuario encontraría los datos que tiene guardados en sus ajustes de cuenta, haciéndolo todo más rápido y fácil. ¿Mola, eh?",
      "hurry_figcaption": "Llamada a la acción de la funcionalidad <span class=\"fst-italic\">Voy con prisa</span> de\n la web de Kikoto.",
      "hurry_video_title": "Funcionalidad <span class=\"fst-italic\">Voy con prisa</span> en la aplicación iOS ",
      "hurry_video_figcaption": "Vídeo grabado directamente en mi teléfono usando la app.",
      "illustrations_title": "Sistema de ilustraciones personalizadas",
      "illustrations_subtitle": "Creación de un lenguaje visual atractivo, persuasivo y consistente",
      "illustrations_description": "Las ilustraciones utilizadas en la app se basan en recursos de Freepik, adaptados cuidadosamente para integrarse con la paleta de colores de la aplicación. Este sistema de ilustraciones es transversal a lo largo del software, creando una identidad visual coherente y reforzando la experiencia del usuario. Las ilustraciones no solo embellecen la interfaz, sino que también captan la atención de los usuarios potenciales en las tiendas de aplicaciones, fortaleciendo el engagement y la presencia visual del producto.",
      "illustrations_section": "Ilustraciones del proyecto",
      "stores_title": "¡Nos lo llevamos a las stores!",
      "stores_subtitle": "Adaptación visual para iOS y Google Play con un enfoque multilingüe",
      "stores_description": "Para lanzar la app en las tiendas, diseñé una serie de screenshots que cuentan una historia visual atractiva, alineada con el sistema de diseño general de la aplicación. Cada captura de pantalla fue creada cuidadosamente para captar la atención de los usuarios y reflejar la identidad de la app. El proceso incluyó la adaptación para iPhone, iPad y dispositivos Android, cumpliendo con los requisitos de las tiendas de Apple y Google Play. Además, cada conjunto de diseños fue traducido y ajustado a tres idiomas: español, inglés y francés, lo que añadió un reto logístico pero esencial para llegar a una audiencia global.",
      "stores_section_ios": "Capturas de pantalla para Apple Store (iPhone y iPad)",
      "stores_section_android": "Capturas de pantalla para Google Play",
      "learn_title": "¿Qué aprendí?",
      "learn_subtitle": "Crear una identidad desde cero es un reto y una oportunidad",
      "learn_description": "Este proyecto me permitió solidificar mi experiencia en la creación de una imagen corporativa completa, desde el concepto hasta la aplicación en diferentes soportes, utilizando recursos gráficos propios.",
      "learn_subtitle_2": "El feedback del cliente es clave, pero el usuario final manda",
      "learn_description_2": "Aprendí a manejar el feedback del cliente, ajustando cambios y soluciones que mantuvieran siempre en mente las necesidades del usuario final.",
      "learn_subtitle_3": "Inspirarse en la competencia es inteligente",
      "learn_description_3": "Observar grandes marcas como Airbnb, Vueling o SkyScanner me demostró que inspirarse en empresas consolidadas no solo es válido, sino beneficioso para mejorar las soluciones de diseño."
    }
  },
  "old_projects": {
    "title": "Proyectos antiguos",
    "description": "Aquí he querido hacer una rápida recopilación de todos los trabajos que hice en el pasado. No son pocos y he seleccionado aquellos más importantes para mí.",
    "subtitle": "Un poquito de historia",
    "other_old_projects": "Otros proyectos antiguos",
    "all": "Todos",
    "branding": "Branding",
    "graphic": "Diseño Gráfico",
    "web": "Web",
    "the_challenge": "El reto",
    "the_idea": "La idea",
    "the_solution": "La solución",
    "observador": {
      "title": "El Observador",
      "intro": "Número 1 recopilatorio de los artículos publicados en El Observador de Castilla-La Mancha. Número especial de la primera promoción de la Facultad de Periodismo de la Universidad de Castilla-La Mancha.",
      "role_1": "Diseño de producto",
      "role_2": "Editor",
      "role_3": "Maquetador",
      "role_4": "Coordinador",
      "client_1": "UCLM",
      "client_2": "www.observador.uclm.es",
      "date": "2014",
      "idea": "La idea surgió durante mis prácticas en el CIDI (Centro de Investigación y Desarrollo de la Imagen) en la UCLM. Descubrí que la maquetación editorial y el diseño gráfico despertaban en mí emociones y sentimientos positivos. En ese entonces, me inspiraba constantemente al observar revistas en salas de espera, casas de amigos y cartas de restaurantes. Esa inspiración me llevó a proponerle a Julio, mi tutor y amigo durante mi formación académica, la maquetación de una revista completa con reportajes de mis compañeros, como colofón de nuestra primera promoción de Periodismo en Cuenca.",
      "challenge": "El desafío fue coordinar a todos mis compañeros para que entregaran material de calidad dentro de los plazos establecidos. Era crucial cuidar los formatos, la extensión y la calidad de las imágenes para asegurar un producto final profesional. Asumí el rol de Product Manager y líder del equipo, organizando eficazmente a la clase y superando las expectativas de profesores y compañeros.",
      "solution": "Abordé el reto con respeto y profesionalidad, manteniendo un ambiente ameno gracias a mis bromas habituales y proporcionando instrucciones claras sobre los detalles técnicos. Ofrecí mi ayuda para quien la necesitara y me encargué de corregir cualquier errata, asegurando que cada aportación cumpliera con los estándares de calidad necesarios para la edición de la revista."
    },
    "psicoesfera": {
      "title": "Psicoesfera",
      "intro": "Psicoesfera es una revista de relatos pulp e ilustración. Como cofundador junto a Beni Díaz, me encargué de la edición de la revista, la maquetación y la coordinación de todo el equipo de ilustradores. Utilizamos WordPress para la web, InDesign para la maquetación y FlipBook para visualizar la revista digital. El proyecto era altruista y no generaba ingresos, pero organizamos camisetas y fiestas geniales con conciertos y proyecciones. Incluso imprimimos un ejemplar especial para Halloween con relatos de terror.",
      "role_1": "Cofundador",
      "role_2": "Editor",
      "role_3": "Maquetador",
      "role_4": "Coordinador de ilustradores",
      "client_1": "Proyecto propio",
      "date": "2014",
      "idea": "La idea surgió para crear una revista que reuniera relatos pulp e ilustraciones, dando espacio a artistas que trabajaban por amor al arte. Como cofundador, mi rol incluía la edición, maquetación y coordinación del equipo creativo.",
      "challenge": "El reto fue coordinar a un gran número de personas que aportaban trabajos excepcionales de manera altruista, sin remuneración económica.",
      "solution": "Asumí la responsabilidad de liderar el equipo y manejar todo el desarrollo técnico del producto, asegurando que el proyecto avanzara y organizando eventos para promoverlo."
    }
  }
}
